{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Analyst Update",
    "1": "Fed | Central Banks",
    "2": "Company | Product News",
    "3": "Treasuries | Corporate Debt",
    "4": "Dividend",
    "5": "Earnings",
    "6": "Energy | Oil",
    "7": "Financials",
    "8": "Currencies",
    "9": "General News | Opinion",
    "10": "Gold | Metals | Materials",
    "11": "IPO",
    "12": "Legal | Regulation",
    "13": "M&A | Investments",
    "14": "Macro",
    "15": "Markets",
    "16": "Politics",
    "17": "Personnel Change",
    "18": "Stock Commentary",
    "19": "Stock Movement"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Analyst Update": 0,
    "Company | Product News": 2,
    "Currencies": 8,
    "Dividend": 4,
    "Earnings": 5,
    "Energy | Oil": 6,
    "Fed | Central Banks": 1,
    "Financials": 7,
    "General News | Opinion": 9,
    "Gold | Metals | Materials": 10,
    "IPO": 11,
    "Legal | Regulation": 12,
    "M&A | Investments": 13,
    "Macro": 14,
    "Markets": 15,
    "Personnel Change": 17,
    "Politics": 16,
    "Stock Commentary": 18,
    "Stock Movement": 19,
    "Treasuries | Corporate Debt": 3
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.47.1",
  "vocab_size": 30522
}
